cask_args appdir: '/Applications'

# Binaries
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'cask'
brew 'htop'
brew 'nmap'
brew 'npm'
brew 'node'
brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'git'
brew 'imagemagick'
brew 'figlet'
brew 'jp2a'
brew 'libcaca'
brew 'openssl'
brew 'readline'
brew 'trash'
brew 'grep'
brew 'mas'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'redshift'
brew 'yarn'
brew 'python3'
brew 'ffmpeg'
brew 'hub'
brew 'thefuck'
brew 'php'
brew 'mysql'
brew 'p7zip' # 7zip
brew 'duti'
cask 'java' # java is required to install gradle
brew 'gradle'
brew 'kakasi' # kanji translation
brew 'pyenv'
brew 'rdfind' # find duplicate files
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'shfmt' # shell formatting
brew 'clang-format'
brew 'composer'
brew 'rust'
brew 'shellcheck'

## Code
cask 'atom'
cask 'chromedriver'
cask 'github'
cask 'mysqlworkbench'
cask 'java'
cask 'adoptopenjdk8'
cask 'phantomjs'
cask 'iterm2'

## Social
cask 'slack'
cask 'discord'
cask 'orangered' # reddit notifier
cask 'zoomus'
cask 'steam'

## Media
cask 'handbrake' # video encoding
cask 'gimp' # image editing
cask 'vlc' # media player
cask 'skitch' # simple image editor by evernote
cask 'alfred' # alternative to spotlight
cask 'google-backup-and-sync'
cask 'cyberduck' # ftp
cask 'docker' # for the docker daemon
cask 'daisydisk' # visualizes volumes
cask 'balenaetcher' # for USB boot drive creation
cask 'keepassxc' # password manager
cask 'spotify'

## Utitlties
cask 'flycut' # clipboard manager
cask 'db-browser-for-sqlite' # sqlite3 GUI
cask 'megasync' # mega.nz
cask 'soundflower' # audio redirection
cask 'speedify' # VPN
cask 'vnc-viewer' # connect to raspberry pi


## Browsers
cask 'google-chrome'
cask 'firefox'
cask 'opera'
cask 'tor-browser'

## Games
cask 'minecraft'
cask 'openemu'
