cask_args appdir: '/Applications'

# Binaries
brew 'bash'
brew 'zsh'
brew 'cask'
brew 'htop'
brew 'nmap'
brew 'npm'
brew 'node'
brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'git'
brew 'imagemagick'
brew 'figlet'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'openssl'
brew 'readline'
brew 'trash'
brew 'grep'
brew 'mas'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'redshift'
brew 'yarn'
brew 'youtube-dl'
brew 'python3'
brew 'ffmpeg'
brew 'php'
brew 'mysql'
brew 'node'
brew 'p7zip' # 7zip
brew 'duti'
brew 'gradle'

# Apps

## Code
cask 'atom'
cask 'chromedriver'
cask 'github'
cask 'mysqlworkbench'
cask 'java'

## Social
cask 'slack'
cask 'discord'
cask 'orangered' # reddit notifier
cask 'zoomus'

## Media
cask 'handbrake' # video encoding
cask 'vlc' # media player
cask 'spotify'
cask 'simple-comic' # alternative to preview

## Utilities
cask 'transmission' # torrent client
cask 'alfred' # alternative to spotlight
cask 'applepi-baker' # burns rasperry pi
cask 'google-backup-and-sync'
cask 'cyberduck' # ftp
cask 'daisydisk' # visualizes volumes
cask 'balenaetcher' # for USB boot drive creation
cask 'keepassxc'
cask 'megasync'
cask 'flycut' # clipboard manager
cask 'soundflower' # redirect sound output
cask 'speedify' # VPN
cask 'puush' # uploads screenshots
cask 'virtualbox' # VM
cask 'vnc-viewer' # GUI for raspberry pi

## Games
cask 'minecraft'
cask 'openemu' # emulator
cask 'steam'
# for hearthstone
cask 'battle-net'
cask 'hstracker'

## Browsers
cask 'google-chrome'
cask 'firefox'
cask 'opera'
cask 'tor-browser'

# Mac App Store
mas 'The Unarchiver', id: 425424353
mas "Bandwidth+", id: 490461369
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Orangered Notifier for Reddit", id: 468366517
