cask_args appdir: '/Applications'

# Binaries
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'cask'
brew 'htop'
brew 'nmap'
brew 'npm'
brew 'node'
brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'git'
brew 'imagemagick'
brew 'figlet'
brew 'jp2a'
brew 'libcaca'
brew 'openssl'
brew 'readline'
brew 'trash'
brew 'grep'
brew 'mas'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'redshift'
brew 'yarn'
brew 'youtube-dl'
brew 'python3'
brew 'ffmpeg'
brew 'php'
brew 'mysql'
brew 'p7zip' # 7zip
brew 'duti'
cask 'java' # java is required to install gradle
brew 'gradle'
brew 'kakasi' # kanji translation
brew 'pyenv'
brew 'rdfind' # find duplicate files
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'docker'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-machine-completion'
brew 'jenkins'
brew 'shfmt' # shell formatting

# Apps

## Code
cask 'atom'
cask 'chromedriver'
cask 'github'
cask 'mysqlworkbench'
cask 'java'
cask 'homebrew/cask-versions/adoptopenjdk8'
cask 'phantomjs'

## Social
cask 'slack'
cask 'discord'
cask 'orangered' # reddit notifier
cask 'zoomus'

## Media
cask 'handbrake' # video encoding
cask 'gimp' # image editing
cask 'vlc' # media player
cask 'skitch' # simple image editor by evernote
cask 'alfred' # alternative to spotlight
cask 'google-backup-and-sync'
cask 'cyberduck' # ftp
cask 'docker' # for the docker daemon
cask 'daisydisk' # visualizes volumes
cask 'balenaetcher' # for USB boot drive creation
cask 'keepassxc'

## Social
cask 'discord'
cask 'slack'

## Browsers
cask 'google-chrome'
cask 'firefox'
cask 'opera'
